app/views/customers/_form.html.erb

    <div class="controls">
      <%= f.collection_select :city_id, City.all, :id, :name, {:prompt => true} %>
---
SELECT "cities".* FROM "cities"