app/views/orders/_form.html.erb

    <div class="controls">
      <%= f.collection_select :customer_id, Customer.all, :id, :name, {:prompt => true} %>
---
SELECT "customers".* FROM "customers"