app/views/orders/_item_form.html.erb

	<tr>
		<td><%= f.collection_select(:product_id, Product.all, :id, :name,  { :prompt => true }) %></td>
---
SELECT "products".* FROM "products"