app/views/orders/_item_list.html.erb

<% @order.items.each do |a| %>
---
SELECT "items".* FROM "items" WHERE "items"."order_id" = 1 AND "items"."id" = ? LIMIT 1  [["id", "2"]]

<% end %>
<%if @order.items.count > 0 %>
---
SELECT COUNT(*) FROM "items" WHERE "items"."order_id" = 2