app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("address", "city_id", "cpfcnpj", "created_at", "date_birth", "district", "email", "name", "number", "rgie", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)