app/controllers/items_controller.rb

  def create
    @item = @order.items.build(params[:item])
    @item.save
---
INSERT INTO "items" ("budget", "created_at", "discount", "finished", "order_id", "price", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @item = @order.items.find(params[:id])
    @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."order_id" = 1 AND "items"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]

  def load_order
    @order = Order.find(params[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]