app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."finished" = 'f'
---
  def index
    @orders = Order.where(finished: false)

INSERT INTO "orders" ("budget", "created_at", "customer_id", "date", "date_forecast", "discount", "finished", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(params[:order])
    @order.finished = false

    respond_to do |format|
      if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "orders" SET "date_forecast" = '2013-01-30', "updated_at" = '2013-01-30 04:11:43.849744' WHERE "orders"."id" = 1
---
  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])