app/controllers/products_controller.rb

INSERT INTO "products" ("category_id", "created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @product = Product.find(params[:id])