app/views/products/_form.html.erb

    <div class="controls">
      <%= f.collection_select(:category_id, Category.all, :id, :name, {:prompt => true}) %>
---
SELECT "categories".* FROM "categories"